SJoyTheHawk/ESP32P4_video_transmission/mipi_csi_camera/mipi_csi_camera.ino
  const uint32_t width = frame.width();
  const uint32_t height = frame.height();
  const size_t expected_size = static_cast<size_t>(width) * height * 2;
  if (frame.data() == nullptr || frame.size() < expected_size) {
    ++dropped_frames;
    Serial.println("invalid RGB565 frame");
    frame.end();
    delay(1);
    return;
  }

  JpegEncodeResult jpeg;
  const uint32_t encode_start_us = micros();
  const bool encoded = capture_controller.encodeBaselineFrame(frame, &jpeg);
  const uint32_t encode_us = micros() - encode_start_us;
  const bool valid_jpeg = encoded && jpeg.size >= 4
                          && jpeg.data[0] == 0xff && jpeg.data[1] == 0xd8
                          && jpeg.data[jpeg.size - 2] == 0xff
                          && jpeg.data[jpeg.size - 1] == 0xd9;
  frame.end();
  if (!valid_jpeg) {
    ++dropped_frames;
    Serial.println("failed to encode JPEG");
    delay(1);
    return;
  }

  const uint32_t send_start_us = micros();
  const RtpFrameSendResult send_result = rtsp_server.sendRTSPFrame(
    jpeg.data, jpeg.size, kJpegQuality, width, height);
  const uint32_t send_us = micros() - send_start_us;
  const uint32_t cycle_us = micros() - cycle_start_us;
  maximum_send_us = max(maximum_send_us, send_us);
  maximum_cycle_us = max(maximum_cycle_us, cycle_us);
  ++stream_sequence;
  if (!send_result.sent) {
    ++dropped_frames;
  }

  Serial.printf(
    "rtp sequence=%lu width=%lu height=%lu bytes=%lu packets=%u "
    "capture_us=%lu encode_us=%lu "
    "send_us=%lu cycle_us=%lu max_send_us=%lu max_cycle_us=%lu "
    "sent=%s error=%d dropped=%lu\n",
    static_cast<unsigned long>(stream_sequence),
    static_cast<unsigned long>(width),
    static_cast<unsigned long>(height),
    static_cast<unsigned long>(jpeg.size), send_result.packetCount,
    static_cast<unsigned long>(capture_us),
    static_cast<unsigned long>(encode_us),
    static_cast<unsigned long>(send_us),
    static_cast<unsigned long>(cycle_us),
    static_cast<unsigned long>(maximum_send_us),
    static_cast<unsigned long>(maximum_cycle_us),
    send_result.sent ? "yes" : "no", send_result.error,
    static_cast<unsigned long>(dropped_frames));

  recordBaselineFrame(jpeg.size, capture_us, encode_us, send_us);

  const uint32_t elapsed_ms = millis() - frame_start_ms;
  if (elapsed_ms < kJpegIntervalMs) {
    delay(kJpegIntervalMs - elapsed_ms);
  }
#else
  delay(1000);
#endif
}
#else
void setup() {
  Serial.begin(115200);
  Serial.println("ESP_IDF_VERSION < 5.4.0, this example is not supported");
}

void loop() {
  delay(1000);
}
#endif
